<template>
  <div class="pa-16">
    <h1 class=" text-center mt-3" >Travel In Bacelona</h1>
    <v-carousel
    cycle
    height="700"
    class="mb-0 px-16 mt-5"
    hide-delimiter-background
    show-arrows-on-hover
  >
    <v-carousel-item
      v-for="(src, i) in imageList"
      :key="i"
     
    >
    <v-img :src="src" max-height="700" aspect-ratio="1.4" contain></v-img>
    </v-carousel-item>
  </v-carousel>
  <h1 class="mt-5 text-center">wellcom to Bacelona</h1>
  <v-sheet>
 บาร์เซโลนา (สเปน: Barcelona) หรือ บาร์ซาโลนา (กาตาลา: Barcelona)เป็นเมืองหลักของแคว้นกาตาลุญญา และเป็นเมืองใหญ่อันดับสองทั้งในด้านขนาดและประชากรของประเทศสเปน มีประชากรในตัวเมือง 1,620,943 คน[6] แต่ถ้านับปริมณฑลโดยรอบอาจมากกว่า 4 ล้านคน ตั้งอยู่บนชายฝั่งทะเลเมดิเตอร์เรเนียนของคาบสมุทรไอบีเรีย ใช้ภาษาทางการ 2 ภาษา คือ ภาษากาตาลาและภาษาสเปนบาร์เซโลนาเป็นเมืองท่าสำคัญ และเป็นเมืองเก่าแก่ที่มีประวัติศาสตร์อันยาวนาน เคยเป็นอาณานิคมของโรมันมาก่อน เคยถูกยึดครองโดยชาติต่าง ๆ หลายครั้ง รวมทั้งฝรั่งเศส เมื่อ พ.ศ. 2183 บาร์เซโลนาเป็นเมืองที่มีชื่อเสียงด้านการท่องเที่ยว โดยเฉพาะการท่องเที่ยวยามราตรีที่รื่นเริงสนุกสนาน บาร์เซโลนามีสถาปัตยกรรมเก่าแก่ที่สำคัญมากมาย อาคารแบบนวศิลป์ที่ดูแปลกประหลาดออกแบบโดยสถาปนิกชาวสเปนชื่ออันตอนี เกาดี นับเป็นจุดดึงดูดด้านการท่องเที่ยวที่สำคัญเมื่อปี พ.ศ. 2535 บาร์เซโลนาเป็นเจ้าภาพจัดการแข่งขันกีฬาโอลิมปิกครั้งที่ 22 และเมื่อ พ.ศ. 2431 เคยเป็นที่จัดงานแสดงสินค้าโลก (World's Fair)
บาร์เซโลนาเป็นเมืองชั้นนำที่มีนักท่องเที่ยว, เศรษฐกิจ, งานแสดงสินค้า และวัฒนธรรมที่ดีที่สุดเมืองหนึ่งของโลก โดยมีชื่อเสียงทั้งด้านการค้า, การศึกษา, สื่อความบันเทิง, แฟชัน, วิทยาศาสตร์ และศิลปะ จนได้ชื่อว่าเป็นเมืองใหญ่เมืองหนึ่งของโลก ซึ่งเป็นศูนย์การทางการค้าและวัฒนธรรมที่ใหญ่ที่สุดแห่งหนึ่งในคาบสมุทรไอบีเรีย และเป็นอันดับที่ 24 ของโลก (ตามหลังซือริช, ก่อนแฟรงก์เฟิร์ต) ในปี พ.ศ. 2551 บาร์เซโลนาเคยติด 10 อันดับที่เศรษฐกิจดีที่สุดตามผลิตภัณฑ์มวลรวมในประเทศ ในสหภาพยุโรป และเป็นอันดับที่ 35 ของโลก ด้วยผลิตภัณฑ์มวลรวมในประเทศมากถึง 177 พันล้านยูโร ในปี พ.ศ. 2555 บาร์เซโลนามีผลิตภัณฑ์มวลรวมในประเทศ 170 พันล้านดอลลาร์สหรัฐ และเป็นเมืองที่มีอัตราการจ้างงานมากที่สุดในประเทศสเปน ณ เวลานั้น[10]
ในปี พ.ศ. 2552 บาร์เซโลนาได้รับการจัดอันดับเป็น 1 ใน 3 เมืองที่ประสบความสำเร็จด้านชื่อเสียงของเมือง[11] ในปีเดียวกัน บาร์เซโลนาได้รับการจัดอันดับเป็น 1 ใน 4 เมืองที่ดีที่สุดสำหรับการทำธุรกิจและเป็นเมืองที่เติบโตรวดเร็วที่สุดถึง 17% ต่อปี และเมืองได้ถูกพัฒนาอย่างต่อเนื่องใน 3 ปีถัดมา บาร์เซโลนาเป็นเมืองชั้นนำที่มีการประยุกต์ใช้แนวคิดสมาร์ตซิตี ในทวีปยุโรป บาร์เซโลนาเป็นศูนย์รวมการขนส่งสาธารณะ ด้วยท่าเรือบาร์เซโลนา ซึ่งเป็นหนึ่งในท่าเรือขนส่งและท่าเรือสำหรับผู้โดยสารที่มีการใช้งานมากที่สุดแห่งหนึ่งในทวีปยุโรป ท่าอากาศยานบาร์เซโลนาเอลปรัต ที่รองรับผู้โดยสาร 50 ล้านคนต่อปี, ทางหลวงพิเศษ และรถไฟความเร็วสูง ซึ่งเชื่อมต่อจากประเทศฝรั่งเศส และประเทศอื่น ๆ ในทวีปยุโรป
  </v-sheet>
</div>
  
</template>

<script>
export default {
  name: 'PhotoPage',
  layout:'Home',
  async asyncData({$content}){
    const post = await $content('posts/hello').fetch()
    console.log('post',post)
    return {post}
  },
   data(){
    return {
      imageList: [
        require("../../assets/img/01.jpg"),
        require("../../assets/img/02.jpg"),
        require("../../assets/img/03.jpg"),
        require("../../assets/img/04.jpg"),
        require("../../assets/img/05.jpg"),
        require("../../assets/img/06.jpg"),
      ],
    }
    
  },
 
  
}
</script>
<style>
.parallax {
   background-attachment:fixed;
   background-size: 100% auto;
 }
</style>